/*# 1)


შექმენით სტუდენტის ობიექტი, რომელსაც აქვს სახელი, ასაკი და ფაკულტეტი.
დავალება: დესტრუქციის გამოყენებით შექმენი ცალკე ცვლადები თითოეული კუთვნილებისთვის.


# 2) 


შექმენით მანქანის ობიექტი, რომელსაც აქვს ბრენდი, მოდელი და გამოშვების წელი.
დავალება: დესტრუქციის დროს ბრენდისა და მოდელის ცვლადებს შეუცვალე სახელები, ხოლო წელი უცვლელად დატოვე.


# 3)


შექმენით მომხმარებლის ობიექტი, რომელსაც აქვს მომხმარებლის სახელი და ელფოსტა, მაგრამ არ აქვს როლი.
დავალება: დესტრუქციის დროს დაამატე ცვლადი role ნაგულისხმევი მნიშვნელობით (მაგალითად: "guest"), იმ შემთხვევისთვის თუ ობიექტში არ არსებობს.


# 4) 


შექმენით პიროვნების ობიექტი, რომელსაც აქვს სახელი, გვარი და მისამართი (მისამართი ცალკე ობიექტია და შეიცავს ქალაქსა და ქვეყანას).
დავალება: დესტრუქციის გამოყენებით მიიღე სახელი, ქალაქი და ქვეყანა.


# 5)


შექმენით პროდუქტის ობიექტი, რომელსაც აქვს დასახელება, ფასი და ვალუტა.
დავალება: შექმენი ფუნქცია, რომელიც პარამეტრში მიიღებს ამ ობიექტს და დესტრუქციის გამოყენებით გამოიყენებს მის კუთვნილებას პროდუქტის ინფორმაციის გამოსატანად.
*/

//1)

const student = { name: 'andrew', age: 15, faculty: 'idk' };

const [myname, myage, myfaculty] = student;

console.log(myname);
console.log(myage);
console.log(myfaculty);

//2)

const car = { brand: "BMW", model: "M5", year: 2022}
